hananddong/ble_uwb_code/UWB_BLE_nrf52832/integration/nrfx/legacy/nrf_drv_uart.h
/**@brief Structure for UART configuration. */
typedef struct
{
    uint32_t            pseltxd;            ///< TXD pin number.
    uint32_t            pselrxd;            ///< RXD pin number.
    uint32_t            pselcts;            ///< CTS pin number.
    uint32_t            pselrts;            ///< RTS pin number.
    void               *p_context;          ///< Context passed to interrupt handler.
    nrf_uart_hwfc_t     hwfc;               ///< Flow control configuration.
    nrf_uart_parity_t   parity;             ///< Parity configuration.
    nrf_uart_baudrate_t baudrate;           ///< Baudrate.
    uint8_t             interrupt_priority; ///< Interrupt priority.
    #if defined(NRF_DRV_UART_WITH_UARTE) && defined(NRF_DRV_UART_WITH_UART)
    bool                use_easy_dma;
    #endif
} nrf_drv_uart_config_t;

#if defined(NRF_DRV_UART_WITH_UARTE) && defined(NRF_DRV_UART_WITH_UART)
extern uint8_t nrf_drv_uart_use_easy_dma[];
#define NRF_DRV_UART_DEFAULT_CONFIG_USE_EASY_DMA  .use_easy_dma = true,
#else
#define NRF_DRV_UART_DEFAULT_CONFIG_USE_EASY_DMA
#endif

/**@brief UART default configuration. */
#define NRF_DRV_UART_DEFAULT_CONFIG                                          \
    {                                                                            \
        .pseltxd            = NRF_UART_PSEL_DISCONNECTED,                        \
                              .pselrxd            = NRF_UART_PSEL_DISCONNECTED,                        \
                                                    .pselcts            = NRF_UART_PSEL_DISCONNECTED,                        \
                                                                          .pselrts            = NRF_UART_PSEL_DISCONNECTED,                        \
                                                                                                .p_context          = NULL,                                              \
                                                                                                        .hwfc               = (nrf_uart_hwfc_t)UART_DEFAULT_CONFIG_HWFC,         \
                                                                                                                .parity             = (nrf_uart_parity_t)UART_DEFAULT_CONFIG_PARITY,     \
                                                                                                                        .baudrate           = (nrf_uart_baudrate_t)UART_DEFAULT_CONFIG_BAUDRATE, \
                                                                                                                                .interrupt_priority = UART_DEFAULT_CONFIG_IRQ_PRIORITY,                  \
                                                                                                                                        NRF_DRV_UART_DEFAULT_CONFIG_USE_EASY_DMA                                 \
    }

/**@brief Structure for UART transfer completion event. */
typedef struct
{
    uint8_t *p_data;  ///< Pointer to memory used for transfer.
    uint8_t   bytes;  ///< Number of bytes transfered.
} nrf_drv_uart_xfer_evt_t;

/**@brief Structure for UART error event. */
typedef struct
{
    nrf_drv_uart_xfer_evt_t rxtx;      ///< Transfer details includes number of bytes transfered.
    uint32_t                error_mask;///< Mask of error flags that generated the event.
} nrf_drv_uart_error_evt_t;

/**@brief Structure for UART event. */
typedef struct
{
    nrf_drv_uart_evt_type_t type;      ///< Event type.
    union
    {
        nrf_drv_uart_xfer_evt_t  rxtx; ///< Data provided for transfer completion events.
        nrf_drv_uart_error_evt_t error;///< Data provided for error event.
    } data;
} nrf_drv_uart_event_t;

/**
    @brief UART interrupt event handler.

    @param[in] p_event    Pointer to event structure. Event is allocated on the stack so it is available
                         only within the context of the event handler.
    @param[in] p_context  Context passed to interrupt handler, set on initialization.
*/
typedef void (*nrf_uart_event_handler_t)(nrf_drv_uart_event_t *p_event, void *p_context);

/**
    @brief Function for initializing the UART driver.

    This function configures and enables UART. After this function GPIO pins are controlled by UART.

    @param[in] p_instance    Pointer to the driver instance structure.
    @param[in] p_config      Initial configuration.
    @param[in] event_handler Event handler provided by the user. If not provided driver works in
                            blocking mode.

    @retval    NRFX_SUCCESS             If initialization was successful.
    @retval    NRFX_ERROR_INVALID_STATE If driver is already initialized.
*/
ret_code_t nrf_drv_uart_init(nrf_drv_uart_t const         *p_instance,
                             nrf_drv_uart_config_t const *p_config,
                             nrf_uart_event_handler_t      event_handler);
                             
/**
    @brief Function for uninitializing  the UART driver.
    @param[in] p_instance Pointer to the driver instance structure.
*/
__STATIC_INLINE
void nrf_drv_uart_uninit(nrf_drv_uart_t const *p_instance);

/**
    @brief Function for getting the address of a specific UART task.

    @param[in] p_instance Pointer to the driver instance structure.
    @param[in] task       Task.

    @return    Task address.
*/
__STATIC_INLINE
uint32_t nrf_drv_uart_task_address_get(nrf_drv_uart_t const *p_instance,
                                       nrf_uart_task_t        task);
                                       
/**
    @brief Function for getting the address of a specific UART event.

    @param[in] p_instance Pointer to the driver instance structure.
    @param[in] event      Event.

    @return    Event address.
*/
__STATIC_INLINE
uint32_t nrf_drv_uart_event_address_get(nrf_drv_uart_t const *p_instance,
                                        nrf_uart_event_t       event);
                                        
/**
    @brief Function for sending data over UART.

    If an event handler was provided in nrf_drv_uart_init() call, this function
    returns immediately and the handler is called when the transfer is done.
    Otherwise, the transfer is performed in blocking mode, i.e. this function
    returns when the transfer is finished. Blocking mode is not using interrupt so
    there is no context switching inside the function.

    @note Peripherals using EasyDMA (i.e. UARTE) require that the transfer buffers
         are placed in the Data RAM region. If they are not and UARTE instance is
         used, this function will fail with error code NRFX_ERROR_INVALID_ADDR.

    @param[in] p_instance Pointer to the driver instance structure.
    @param[in] p_data     Pointer to data.
    @param[in] length     Number of bytes to send.

    @retval    NRFX_SUCCESS            If initialization was successful.
    @retval    NRFX_ERROR_BUSY         If driver is already transferring.
    @retval    NRFX_ERROR_FORBIDDEN    If the transfer was aborted from a different context
                                      (blocking mode only, also see @ref nrf_drv_uart_rx_disable).
    @retval    NRFX_ERROR_INVALID_ADDR If p_data does not point to RAM buffer (UARTE only).
*/
__STATIC_INLINE
ret_code_t nrf_drv_uart_tx(nrf_drv_uart_t const *p_instance,
                           uint8_t const *const  p_data,
                           uint8_t                length);
                           
/**
    @brief Function for checking if UART is currently transmitting.

    @param[in] p_instance Pointer to the driver instance structure.

    @retval true  If UART is transmitting.
    @retval false If UART is not transmitting.
*/
__STATIC_INLINE
bool nrf_drv_uart_tx_in_progress(nrf_drv_uart_t const *p_instance);

/**
    @brief Function for aborting any ongoing transmission.
    @note @ref NRF_DRV_UART_EVT_TX_DONE event will be generated in non-blocking mode. Event will
         contain number of bytes sent until abort was called. If Easy DMA is not used event will be
         called from the function context. If Easy DMA is used it will be called from UART interrupt
         context.

    @param[in] p_instance Pointer to the driver instance structure.
*/
__STATIC_INLINE
void nrf_drv_uart_tx_abort(nrf_drv_uart_t const *p_instance);

/**
    @brief Function for receiving data over UART.

