hananddong/ble_uwb_code/UWB_BLE_nrf52832/integration/nrfx/legacy/nrf_drv_uart.h
    If an event handler was provided in the nrf_drv_uart_init() call, this function
    returns immediately and the handler is called when the transfer is done.
    Otherwise, the transfer is performed in blocking mode, i.e. this function
    returns when the transfer is finished. Blocking mode is not using interrupt so
    there is no context switching inside the function.
    The receive buffer pointer is double buffered in non-blocking mode. The secondary
    buffer can be set immediately after starting the transfer and will be filled
    when the primary buffer is full. The double buffering feature allows
    receiving data continuously.

    @note Peripherals using EasyDMA (i.e. UARTE) require that the transfer buffers
         are placed in the Data RAM region. If they are not and UARTE driver instance
         is used, this function will fail with error code NRFX_ERROR_INVALID_ADDR.

    @param[in] p_instance Pointer to the driver instance structure.
    @param[in] p_data     Pointer to data.
    @param[in] length     Number of bytes to receive.

    @retval    NRFX_SUCCESS If initialization was successful.
    @retval    NRFX_ERROR_BUSY If the driver is already receiving
                              (and the secondary buffer has already been set
                              in non-blocking mode).
    @retval    NRFX_ERROR_FORBIDDEN If the transfer was aborted from a different context
                                  (blocking mode only, also see @ref nrf_drv_uart_rx_disable).
    @retval    NRFX_ERROR_INTERNAL If UART peripheral reported an error.
    @retval    NRFX_ERROR_INVALID_ADDR If p_data does not point to RAM buffer (UARTE only).
*/
__STATIC_INLINE
ret_code_t nrf_drv_uart_rx(nrf_drv_uart_t const *p_instance,
                           uint8_t               *p_data,
                           uint8_t                length);
                           
                           
                           
/**
    @brief Function for testing the receiver state in blocking mode.

    @param[in] p_instance Pointer to the driver instance structure.

    @retval true  If the receiver has at least one byte of data to get.
    @retval false If the receiver is empty.
*/
__STATIC_INLINE
bool nrf_drv_uart_rx_ready(nrf_drv_uart_t const *p_instance);

/**
    @brief Function for enabling the receiver.

    UART has a 6-byte-long RX FIFO and it is used to store incoming data. If a user does not call the
    UART receive function before the FIFO is filled, an overrun error will appear. Enabling the receiver
    without specifying an RX buffer is supported only in UART mode (without Easy DMA). The receiver must be
    explicitly closed by the user @sa nrf_drv_uart_rx_disable. This function asserts if the mode is wrong.

    @param[in] p_instance Pointer to the driver instance structure.
*/
__STATIC_INLINE
void nrf_drv_uart_rx_enable(nrf_drv_uart_t const *p_instance);

/**
    @brief Function for disabling the receiver.

    This function must be called to close the receiver after it has been explicitly enabled by
    @sa nrf_drv_uart_rx_enable. The feature is supported only in UART mode (without Easy DMA). The function
    asserts if mode is wrong.

    @param[in] p_instance Pointer to the driver instance structure.
*/
__STATIC_INLINE
void nrf_drv_uart_rx_disable(nrf_drv_uart_t const *p_instance);

/**
    @brief Function for aborting any ongoing reception.
    @note @ref NRF_DRV_UART_EVT_RX_DONE event will be generated in non-blocking mode. The event will
         contain the number of bytes received until abort was called. The event is called from UART interrupt
         context.

    @param[in] p_instance Pointer to the driver instance structure.
*/
__STATIC_INLINE
void nrf_drv_uart_rx_abort(nrf_drv_uart_t const *p_instance);

/**
    @brief Function for reading error source mask. Mask contains values from @ref nrf_uart_error_mask_t.
    @note Function should be used in blocking mode only. In case of non-blocking mode, an error event is
         generated. Function clears error sources after reading.

    @param[in] p_instance Pointer to the driver instance structure.

    @retval    Mask of reported errors.
*/
__STATIC_INLINE
uint32_t nrf_drv_uart_errorsrc_get(nrf_drv_uart_t const *p_instance);


#ifndef SUPPRESS_INLINE_IMPLEMENTATION

#if defined(NRF_DRV_UART_WITH_UARTE) && defined(NRF_DRV_UART_WITH_UART)
#define NRF_DRV_UART_USE_UARTE  (nrf_drv_uart_use_easy_dma[p_instance->inst_idx])
#elif defined(NRF_DRV_UART_WITH_UARTE)
#define NRF_DRV_UART_USE_UARTE  true
#else
#define NRF_DRV_UART_USE_UARTE  false
#endif
#define NRF_DRV_UART_USE_UART  (!NRF_DRV_UART_USE_UARTE)

__STATIC_INLINE
void nrf_drv_uart_uninit(nrf_drv_uart_t const *p_instance)
{
    if(NRF_DRV_UART_USE_UARTE)
        nrfx_uarte_uninit(&p_instance->uarte);
        
    else if(NRF_DRV_UART_USE_UART)
        nrfx_uart_uninit(&p_instance->uart);
}

__STATIC_INLINE
uint32_t nrf_drv_uart_task_address_get(nrf_drv_uart_t const *p_instance,
                                       nrf_uart_task_t task)
{
    uint32_t result = 0;
    
    if(NRF_DRV_UART_USE_UARTE)
    {
        result = nrfx_uarte_task_address_get(&p_instance->uarte,
                                             (nrf_uarte_task_t)task);
    }
    
    else if(NRF_DRV_UART_USE_UART)
        result = nrfx_uart_task_address_get(&p_instance->uart, task);
        
    return result;
}

__STATIC_INLINE
uint32_t nrf_drv_uart_event_address_get(nrf_drv_uart_t const *p_instance,
                                        nrf_uart_event_t event)
{
    uint32_t result = 0;
    
    if(NRF_DRV_UART_USE_UARTE)
    {
        result = nrfx_uarte_event_address_get(&p_instance->uarte,
                                              (nrf_uarte_event_t)event);
    }
    
    else if(NRF_DRV_UART_USE_UART)
        result = nrfx_uart_event_address_get(&p_instance->uart, event);
        
    return result;
}

__STATIC_INLINE
ret_code_t nrf_drv_uart_tx(nrf_drv_uart_t const *p_instance,
                           uint8_t const         *p_data,
                           uint8_t                length)
{
    uint32_t result = 0;
    
