hananddong/ble_uwb_code/UWB_BLE_nrf52832/integration/nrfx/legacy/nrf_drv_uart.h
    if(NRF_DRV_UART_USE_UARTE)
    {
        result = nrfx_uarte_tx(&p_instance->uarte,
                               p_data,
                               length);
    }
    
    else if(NRF_DRV_UART_USE_UART)
    {
        result = nrfx_uart_tx(&p_instance->uart,
                              p_data,
                              length);
    }
    
    return result;
}

__STATIC_INLINE
bool nrf_drv_uart_tx_in_progress(nrf_drv_uart_t const *p_instance)
{
    bool result = 0;
    
    if(NRF_DRV_UART_USE_UARTE)
        result = nrfx_uarte_tx_in_progress(&p_instance->uarte);
        
    else if(NRF_DRV_UART_USE_UART)
        result = nrfx_uart_tx_in_progress(&p_instance->uart);
        
    return result;
}

__STATIC_INLINE
void nrf_drv_uart_tx_abort(nrf_drv_uart_t const *p_instance)
{
    if(NRF_DRV_UART_USE_UARTE)
        nrfx_uarte_tx_abort(&p_instance->uarte);
        
    else if(NRF_DRV_UART_USE_UART)
        nrfx_uart_tx_abort(&p_instance->uart);
}

__STATIC_INLINE
ret_code_t nrf_drv_uart_rx(nrf_drv_uart_t const *p_instance,
                           uint8_t               *p_data,
                           uint8_t                length)
{
    uint32_t result = 0;
    
    if(NRF_DRV_UART_USE_UARTE)
    {
        result = nrfx_uarte_rx(&p_instance->uarte,
                               p_data,
                               length);
    }
    
    else if(NRF_DRV_UART_USE_UART)
    {
        result = nrfx_uart_rx(&p_instance->uart,
                              p_data,
                              length);
    }
    
    return result;
}

__STATIC_INLINE
bool nrf_drv_uart_rx_ready(nrf_drv_uart_t const *p_instance)
{
    bool result = 0;
    
    if(NRF_DRV_UART_USE_UARTE)
        result = nrfx_uarte_rx_ready(&p_instance->uarte);
        
    else if(NRF_DRV_UART_USE_UART)
        result = nrfx_uart_rx_ready(&p_instance->uart);
        
    return result;
}

__STATIC_INLINE
void nrf_drv_uart_rx_enable(nrf_drv_uart_t const *p_instance)
{
    if(NRF_DRV_UART_USE_UARTE)
    {
        NRFX_ASSERT(false); // not supported
    }
    
    else if(NRF_DRV_UART_USE_UART)
        nrfx_uart_rx_enable(&p_instance->uart);
}

__STATIC_INLINE
void nrf_drv_uart_rx_disable(nrf_drv_uart_t const *p_instance)
{
    if(NRF_DRV_UART_USE_UARTE)
    {
        NRFX_ASSERT(false); // not supported
    }
    
    else if(NRF_DRV_UART_USE_UART)
        nrfx_uart_rx_disable(&p_instance->uart);
}

__STATIC_INLINE
void nrf_drv_uart_rx_abort(nrf_drv_uart_t const *p_instance)
{
    if(NRF_DRV_UART_USE_UARTE)
        nrfx_uarte_rx_abort(&p_instance->uarte);
        
    else if(NRF_DRV_UART_USE_UART)
        nrfx_uart_rx_abort(&p_instance->uart);
}

__STATIC_INLINE
uint32_t nrf_drv_uart_errorsrc_get(nrf_drv_uart_t const *p_instance)
{
    uint32_t result = 0;
    
    if(NRF_DRV_UART_USE_UARTE)
        result = nrfx_uarte_errorsrc_get(&p_instance->uarte);
        
    else if(NRF_DRV_UART_USE_UART)
    {
        nrf_uart_event_clear(p_instance->uart.p_reg, NRF_UART_EVENT_ERROR);
        result = nrfx_uart_errorsrc_get(&p_instance->uart);
    }
    
    return result;
}

#endif // SUPPRESS_INLINE_IMPLEMENTATION

/** @} */

#ifdef __cplusplus
}
#endif

#endif // NRF_DRV_UART_H__
